First go to the CLI terminal and type sqlite3 to check if the system has it
if we have it, we will be redirected to sqlite prompt. type '.help' to see all the commands and '.quit' to exit the sqlite prompt.

https://www.tutorialspoint.com/sqlite/index.htm # this link is for introduction to sqlite 

https://www.tutorialspoint.com/sqlite/sqlite_python.htm # this is for knowing how to use sqlite using python

http://www.sqlitetutorial.net/sqlite-python/ #python

In [3]:
import sqlite3

To use sqlite3 module, you must first create a connection object that represents the database and then optionally you can create a cursor object, which will help you in executing all the SQL statements.(not created cursor=conn.cursor()for this notebook)

In [4]:
conn = sqlite3.connect('factory.db') #connecting to database factory.db, if it is not exsisting new databse 
#+ under that name will be created in current directory

NOT NULL is the constraints for not allowing NULL in the records of column ID_num.A primary key column cannot have NULL values.primary keyword in a relational database is unique for each record/row. CREATE TABLE- is a statement, CREATE-Data Definition Language and it is a command

I have created the table called employee_details in factory.db, the column name with their datatype is specified. ID_num is the primary key for this table.

In [16]:
conn.execute('''CREATE TABLE employee_details
(ID_num INT PRIMARY KEY NOT NULL,
 NAME TEXT NOT NULL,
 AGE INT,
 ADDRESS BLOB(60),
 SALARY REAL);
''')
conn.close()

creating Records in employee_details table one by one using INSERT-Data Manipulation Language ,INSERT INTO -is a statement and INSERT is a command. Note: never give a space after '\', or else will raise error

In [17]:
conn.execute("INSERT INTO employee_details(ID_num,NAME,AGE,ADDRESS,SALARY) \
      VALUES (101, 'qaz', 18, '#514,atlantic', 20000.00 )");

conn.execute("INSERT INTO employee_details (ID_num,NAME,AGE,ADDRESS,SALARY) \
      VALUES (102, 'wsx', 20, '@apt,nj', 15000.00 )");

conn.execute("INSERT INTO employee_details (ID_num,NAME,AGE,ADDRESS,SALARY) \
      VALUES (103, 'edc', 23, '!gorgia', 20000.00 )");

conn.commit()

ProgrammingError: Cannot operate on a closed database.

Connecting back to database since I closed it earlier using conn.close()

In [18]:
conn = sqlite3.connect('factory.db')

In [21]:
conn.execute("INSERT INTO employee_details(ID_num,NAME,AGE,ADDRESS,SALARY) \
      VALUES (101, 'qaz', 18, '#514,atlantic', 20000.00 )");

conn.execute("INSERT INTO employee_details(ID_num,NAME,AGE,ADDRESS,SALARY) \
      VALUES (102, 'wsx', 20, '@apt,nj', 15000.00 )");

conn.execute("INSERT INTO employee_details(ID_num,NAME,AGE,ADDRESS,SALARY) \
      VALUES (103, 'edc', 23, '!gorgia', 20000.00 )");

conn.execute("INSERT INTO employee_details(ID_num,NAME,AGE,ADDRESS,SALARY) \
      VALUES (1, 'qaz', 18, '#514,atlantic', 20000.00 )");

conn.execute("INSERT INTO employee_details(ID_num,NAME,AGE,ADDRESS,SALARY) \
      VALUES (2, 'wsx', 20, '@apt,nj', 15000.00 )");

conn.execute("INSERT INTO employee_details(ID_num,NAME,AGE,ADDRESS,SALARY) \
      VALUES (3, 'edc', 23, '!gorgia', 20000.00 )");

conn.execute("INSERT INTO employee_details(ID_num,NAME,AGE,ADDRESS,SALARY) \
      VALUES (4, 'rfv', 25, 'Rich-Mond', 65000.00 )");

conn.commit()

###### how to retrieve and display records from the employee_details table  using SELECT command-Data Query Language

In [23]:
data = conn.execute("SELECT id_num, name, address, salary FROM EMPLOYEE_DETAILS")
for row in data:
   print("ID_num = ", row[0])
   print("NAME = ", row[1])
   print("ADDRESS = ", row[2])
   print("SALARY = ", row[3], "\n")

ID_num =  101
NAME =  qaz
ADDRESS =  #514,atlantic
SALARY =  20000.0

ID_num =  102
NAME =  wsx
ADDRESS =  @apt,nj
SALARY =  15000.0

ID_num =  103
NAME =  edc
ADDRESS =  !gorgia
SALARY =  20000.0

ID_num =  1
NAME =  qaz
ADDRESS =  #514,atlantic
SALARY =  20000.0

ID_num =  2
NAME =  wsx
ADDRESS =  @apt,nj
SALARY =  15000.0

ID_num =  3
NAME =  edc
ADDRESS =  !gorgia
SALARY =  20000.0

ID_num =  4
NAME =  rfv
ADDRESS =  Rich-Mond
SALARY =  65000.0

As the command executed above, SQLite is case insensitive but exceptions are for commands and statements

UPDATE statement to update any record and then fetch and display the updated records from the employee_details table.

In [25]:
conn.execute("UPDATE employee_details set SALARY = 15000.00 where ID_num = 1")
conn.execute("UPDATE employee_details set NAME = 'tgb' where ID_num= 4")
conn.commit
print("Total number of rows updated :", conn.total_changes)

Total number of rows updated : 9

In [26]:
data = conn.execute("SELECT id_num, name, address, salary FROM EMPLOYEE_DETAILS")
for row in data:
   print("ID_num = ", row[0])
   print("NAME = ", row[1])
   print("ADDRESS = ", row[2])
   print("SALARY = ", row[3], "\n")

ID_num =  101
NAME =  qaz
ADDRESS =  #514,atlantic
SALARY =  20000.0

ID_num =  102
NAME =  wsx
ADDRESS =  @apt,nj
SALARY =  15000.0

ID_num =  103
NAME =  edc
ADDRESS =  !gorgia
SALARY =  20000.0

ID_num =  1
NAME =  qaz
ADDRESS =  #514,atlantic
SALARY =  15000.0

ID_num =  2
NAME =  wsx
ADDRESS =  @apt,nj
SALARY =  15000.0

ID_num =  3
NAME =  edc
ADDRESS =  !gorgia
SALARY =  20000.0

ID_num =  4
NAME =  tgb
ADDRESS =  Rich-Mond
SALARY =  65000.0

DELETE statement to delete any record and then fetch and display the remaining records from the employee_details table.

In [27]:
conn.execute("DELETE from employee_details where ID_num = 101;")
conn.execute("DELETE from employee_details where ID_num = 102;")
conn.execute("DELETE from employee_details where ID_num = 103;")
conn.commit()
print ("Total number of rows deleted :", conn.total_changes)

Total number of rows deleted : 12

In [5]:
data = conn.execute("SELECT id_num, name, address, salary FROM EMPLOYEE_DETAILS")
for row in data:
   print("ID_num = ", row[0])
   print("NAME = ", row[1])
   print("ADDRESS = ", row[2])
   print("SALARY = ", row[3], "\n")
conn.close()

ID_num =  1
NAME =  qaz
ADDRESS =  #514,atlantic
SALARY =  15000.0

ID_num =  2
NAME =  wsx
ADDRESS =  @apt,nj
SALARY =  15000.0

ID_num =  3
NAME =  edc
ADDRESS =  !gorgia
SALARY =  20000.0

ID_num =  4
NAME =  tgb
ADDRESS =  Rich-Mond
SALARY =  65000.0